rorke-time/sriov_rorke_time/rorke250-memtier-250k.txt
Executing: memtier_benchmark -h 128.110.218.200 -p 11211 --ratio=1:10 --test-time=30 --rate-limiting=1250 -t 8 -c 25 --key-pattern=P:P --key-maximum 1000000 -P memcache_text
8         Threads
25        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        20207.13          ---          ---         0.72135         0.54300         3.16700         5.43900      1359.36 
Gets       202039.37     80134.25    121905.13         0.70926         0.53500         3.13500         5.34300      9674.60 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     222246.51     80134.25    121905.13         0.71036         0.53500         3.13500         5.34300     11033.95 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.039        0.000
SET       0.143        5.000
SET       0.303       10.000
SET       0.407       15.000
SET       0.447       20.000
SET       0.463       25.000
SET       0.487       30.000
SET       0.495       35.000
SET       0.511       40.000
SET       0.527       45.000
SET       0.543       50.000
SET       0.551       52.500
SET       0.567       55.000
SET       0.575       57.500
SET       0.591       60.000
SET       0.615       62.500
SET       0.647       65.000
SET       0.687       67.500
SET       0.743       70.000
SET       0.799       72.500
SET       0.863       75.000
SET       0.895       76.250
SET       0.919       77.500
SET       0.943       78.750
SET       0.967       80.000
SET       0.983       81.250
SET       1.007       82.500
SET       1.023       83.750
SET       1.047       85.000
SET       1.079       86.250
SET       1.119       87.500
SET       1.151       88.125
SET       1.191       88.750
SET       1.231       89.375
SET       1.271       90.000
SET       1.319       90.625
SET       1.375       91.250
SET       1.431       91.875
SET       1.471       92.500
SET       1.511       93.125
SET       1.551       93.750
SET       1.575       94.062
SET       1.615       94.375
SET       1.655       94.688
SET       1.719       95.000
SET       1.783       95.312
SET       1.871       95.625
SET       1.943       95.938
SET       1.999       96.250
SET       2.039       96.562
SET       2.095       96.875
SET       2.143       97.031
SET       2.191       97.188
SET       2.255       97.344
SET       2.319       97.500
SET       2.415       97.656
SET       2.479       97.812
SET       2.527       97.969
SET       2.575       98.125
SET       2.655       98.281
SET       2.751       98.438
SET       2.815       98.516
SET       2.879       98.594
SET       2.959       98.672
SET       3.007       98.750
SET       3.055       98.828
SET       3.087       98.906
SET       3.151       98.984
SET       3.247       99.062
SET       3.343       99.141
SET       3.455       99.219
SET       3.503       99.258
SET       3.551       99.297
SET       3.599       99.336
SET       3.631       99.375
SET       3.711       99.414
SET       3.791       99.453
SET       3.871       99.492
SET       3.967       99.531
SET       4.047       99.570
SET       4.127       99.609
SET       4.159       99.629
SET       4.255       99.648
SET       4.319       99.668
SET       4.383       99.688
SET       4.479       99.707
SET       4.543       99.727
SET       4.607       99.746
SET       4.671       99.766
SET       4.735       99.785
SET       4.831       99.805
SET       4.895       99.814
SET       4.927       99.824
SET       4.991       99.834
SET       5.055       99.844
SET       5.087       99.854
SET       5.119       99.863
SET       5.183       99.873
SET       5.279       99.883
SET       5.375       99.893
SET       5.471       99.902
SET       5.535       99.907
SET       5.567       99.912
SET       5.599       99.917
SET       5.663       99.922
SET       5.727       99.927
SET       5.823       99.932
SET       5.919       99.937
SET       6.047       99.941
SET       6.079       99.946
SET       6.143       99.951
SET       6.207       99.954
SET       6.239       99.956
SET       6.303       99.958
SET       6.367       99.961
SET       6.431       99.963
SET       6.495       99.966
SET       6.559       99.968
SET       6.591       99.971
SET       6.687       99.973
SET       6.783       99.976
SET       6.815       99.977
SET       6.847       99.978
SET       6.911       99.979
SET       6.943       99.980
SET       7.007       99.982
SET       7.071       99.983
SET       7.135       99.984
SET       7.199       99.985
SET       7.263       99.987
SET       7.391       99.988
SET       7.455       99.988
SET       7.519       99.989
SET       7.519       99.990
SET       7.583       99.990
SET       7.647       99.991
SET       7.711       99.991
SET       7.711       99.992
SET       7.807       99.993
SET       7.871       99.993
SET       7.903       99.994
SET       7.935       99.994
SET       7.935       99.995
SET       7.967       99.995
SET       8.063       99.995
SET       8.095       99.995
SET       8.255       99.996
SET       8.255       99.996
SET       8.383       99.996
SET       8.447       99.997
SET       8.511       99.997
SET       8.511       99.997
SET       8.639       99.997
SET       8.639       99.997
SET       8.639       99.998
SET       8.639       99.998
SET       8.703       99.998
SET       8.703       99.998
SET       8.703       99.998
SET       8.767       99.998
SET       8.831       99.998
SET       8.831       99.999
SET       8.831       99.999
SET       8.895       99.999
SET       8.895       99.999
SET       8.959       99.999
SET       8.959       99.999
SET       8.959       99.999
SET       9.023       99.999
SET       9.023       99.999
SET       9.279       99.999
SET       9.279       99.999
SET       9.279       99.999
SET       9.727       99.999
SET       9.727       99.999
SET       9.727       99.999
[...]
SET       9.727      100.000
SET       9.791      100.000
SET       9.791      100.000
SET       9.791      100.000
[...]
SET      10.047      100.000
SET      10.047      100.000
SET      10.047      100.000
[...]
SET      10.111      100.000
SET      10.111      100.000
---
GET       0.039        0.000
GET       0.135        5.000
GET       0.279       10.000
GET       0.399       15.000
GET       0.439       20.000
GET       0.463       25.000
GET       0.479       30.000
GET       0.495       35.000
GET       0.511       40.000
GET       0.519       45.000
GET       0.535       50.000
GET       0.543       52.500
GET       0.559       55.000
GET       0.567       57.500
GET       0.583       60.000
GET       0.607       62.500
GET       0.631       65.000
GET       0.671       67.500
GET       0.719       70.000
GET       0.775       72.500
GET       0.839       75.000
GET       0.871       76.250
GET       0.895       77.500
GET       0.927       78.750
GET       0.951       80.000
GET       0.975       81.250
GET       0.991       82.500
GET       1.015       83.750
GET       1.031       85.000
GET       1.063       86.250
GET       1.095       87.500
GET       1.127       88.125
GET       1.159       88.750
GET       1.199       89.375
GET       1.239       90.000
GET       1.287       90.625
GET       1.343       91.250
GET       1.399       91.875
GET       1.455       92.500
GET       1.495       93.125
GET       1.535       93.750
GET       1.559       94.062
GET       1.591       94.375
GET       1.631       94.688
GET       1.687       95.000
GET       1.751       95.312
GET       1.823       95.625
GET       1.911       95.938
GET       1.983       96.250
GET       2.023       96.562
GET       2.079       96.875
GET       2.111       97.031
GET       2.159       97.188
GET       2.239       97.344
GET       2.303       97.500
GET       2.383       97.656
GET       2.463       97.812
GET       2.511       97.969
GET       2.559       98.125
GET       2.623       98.281
GET       2.719       98.438
GET       2.783       98.516
GET       2.847       98.594
GET       2.911       98.672
GET       2.975       98.750
GET       3.023       98.828
GET       3.071       98.906
GET       3.119       98.984
GET       3.199       99.062
GET       3.295       99.141
GET       3.407       99.219
GET       3.471       99.258
GET       3.519       99.297
GET       3.567       99.336
GET       3.599       99.375
GET       3.663       99.414
GET       3.743       99.453
GET       3.823       99.492
GET       3.903       99.531
GET       3.999       99.570
GET       4.079       99.609
GET       4.127       99.629
GET       4.159       99.648
GET       4.223       99.668
GET       4.287       99.688
GET       4.383       99.707
GET       4.447       99.727
GET       4.543       99.746
GET       4.607       99.766
GET       4.671       99.785
GET       4.735       99.805
GET       4.799       99.814
GET       4.863       99.824
GET       4.927       99.834
GET       4.991       99.844
GET       5.023       99.854
GET       5.087       99.863
GET       5.151       99.873
GET       5.215       99.883
GET       5.279       99.893
GET       5.375       99.902
GET       5.439       99.907
GET       5.503       99.912
GET       5.567       99.917
GET       5.599       99.922
GET       5.663       99.927
GET       5.727       99.932
GET       5.823       99.937
GET       5.887       99.941
GET       5.983       99.946
GET       6.079       99.951
GET       6.143       99.954
GET       6.175       99.956
GET       6.239       99.958
GET       6.303       99.961
GET       6.367       99.963
GET       6.431       99.966
GET       6.527       99.968
GET       6.591       99.971
GET       6.687       99.973
GET       6.783       99.976
GET       6.815       99.977
GET       6.879       99.978
GET       6.943       99.979
GET       7.007       99.980
GET       7.071       99.982
GET       7.135       99.983
GET       7.199       99.984
GET       7.263       99.985
GET       7.359       99.987
GET       7.423       99.988
GET       7.487       99.988
GET       7.551       99.989
GET       7.615       99.990
GET       7.679       99.990
GET       7.743       99.991
GET       7.807       99.991
GET       7.871       99.992
GET       7.935       99.993
GET       8.031       99.993
GET       8.127       99.994
GET       8.159       99.994
GET       8.255       99.995
GET       8.255       99.995
GET       8.319       99.995
GET       8.383       99.995
GET       8.447       99.996
GET       8.511       99.996
GET       8.575       99.996
GET       8.703       99.997
GET       8.767       99.997
GET       8.767       99.997
GET       8.831       99.997
GET       8.895       99.997
GET       8.959       99.998
GET       9.023       99.998
GET       9.087       99.998
GET       9.151       99.998
GET       9.215       99.998
GET       9.279       99.998
GET       9.343       99.998
GET       9.407       99.999
GET       9.407       99.999
GET       9.407       99.999
GET       9.471       99.999
GET       9.535       99.999
GET       9.599       99.999
GET       9.663       99.999
GET       9.663       99.999
GET       9.727       99.999
GET       9.791       99.999
GET       9.855       99.999
GET       9.855       99.999
GET       9.855       99.999
[...]
GET       9.919       99.999
GET       9.919       99.999
GET       9.919      100.000
GET       9.983      100.000
GET       9.983      100.000
GET       9.983      100.000
[...]
GET      10.047      100.000
GET      10.047      100.000
GET      10.047      100.000
[...]
GET      10.111      100.000
GET      10.239      100.000
GET      10.303      100.000
GET      10.367      100.000
GET      10.367      100.000
GET      10.367      100.000
[...]
GET      10.495      100.000
GET      10.495      100.000
GET      10.495      100.000
GET      10.751      100.000
GET      10.751      100.000
GET      10.751      100.000
GET      10.815      100.000
GET      10.815      100.000
GET      10.815      100.000
[...]
GET      11.455      100.000
GET      11.455      100.000
GET      11.455      100.000
[...]
GET      11.903      100.000
GET      11.903      100.000
---
WAIT      0.000      100.000